# Birth Names Data

In [1]:
# Import Dependencies
import pandas as pd
from pprint import pprint 
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, func, inspect,join
import glob
from sqlalchemy import create_engine
import psycopg2
import json
from pprint import pprint
import re
# from secret import username, password

In [ ]:
############Cleaning##############

In [2]:
# #Import csv files

# # Use glob module to include all csv files together
# all_files = glob.glob('Resources/*.csv')

# # Create and empty list to append to 
# li = []

# # Write a for loop to import all csv files, include headers
# for filename in all_files:
#     df = pd.read_csv(filename, index_col=None, header=None, names = ['State','Sex', 'Year','Name', 'Number'])
#     li.append(df)
    
# # Concatenate all csv files 
# names_df = pd.concat(li, axis=0, ignore_index=True)

In [3]:
# Check DataFrame
# names_df=names_df.loc[names_df["year"]>=2000]
names_df

        State Sex  Year      Name  Number
0          AK   F  1910      Mary      14
1          AK   F  1910     Annie      12
2          AK   F  1910      Anna      10
3          AK   F  1910  Margaret       8
4          AK   F  1910     Helen       7
...       ...  ..   ...       ...     ...
6028146    WY   M  2018    Peyton       5
6028147    WY   M  2018   Richard       5
6028148    WY   M  2018     Titus       5
6028149    WY   M  2018   Tristan       5
6028150    WY   M  2018    Zander       5

[6028151 rows x 5 columns]

In [17]:
names_df=names_df.loc[(names_df["Year"]>=1960) & (names_df["Number"]>1000 )]
names_df

        State Sex  Year      Name  Number
462415     CA   F  1980  Jennifer    5611
462416     CA   F  1980   Melissa    2984
462417     CA   F  1980   Jessica    2928
462418     CA   F  1980     Sarah    2578
462419     CA   F  1980  Michelle    2432
...       ...  ..   ...       ...     ...
5898660    WI   M  1983   Michael    1337
5899111    WI   M  1984   Michael    1383
5899112    WI   M  1984   Matthew    1252
5899581    WI   M  1985   Michael    1265
5900065    WI   M  1986   Michael    1207

[7104 rows x 5 columns]

In [18]:
# Check info of DataFrame
names_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7104 entries, 462415 to 5900065
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   State   7104 non-null   object
 1   Sex     7104 non-null   object
 2   Year    7104 non-null   int64
 3   Name    7104 non-null   object
 4   Number  7104 non-null   int64
dtypes: int64(2), object(3)
memory usage: 333.0+ KB

In [19]:
names_df.to_csv('Resources/ALL_STATES.csv')

In [10]:
rd=pd.read_csv('Resources/ALL_STATES.csv')
cor=pd.read_csv('Resources/states.csv')

In [11]:
rd.head()

   Unnamed: 0 State Sex  Year      Name  Number
0      462415    CA   F  1980  Jennifer    5611
1      462416    CA   F  1980   Melissa    2984
2      462417    CA   F  1980   Jessica    2928
3      462418    CA   F  1980     Sarah    2578
4      462419    CA   F  1980  Michelle    2432

In [12]:
cor.head()

  State   Latitude   Longitude        City
0    AL  32.601011  -86.680736     Alabama
1    AK  61.302501 -158.775020      Alaska
2    AZ  34.168219 -111.930907     Arizona
3    AR  34.751928  -92.131378    Arkansas
4    CA  37.271875 -119.270415  California

In [13]:
df=pd.merge(rd,cor, on='State', how='inner')

In [15]:
df=df[['State','Sex','Year','Name','Number','Latitude','Longitude','City']]

In [16]:
df

     State Sex  Year      Name  Number   Latitude   Longitude        City
0       CA   F  1980  Jennifer    5611  37.271875 -119.270415  California
1       CA   F  1980   Melissa    2984  37.271875 -119.270415  California
2       CA   F  1980   Jessica    2928  37.271875 -119.270415  California
3       CA   F  1980     Sarah    2578  37.271875 -119.270415  California
4       CA   F  1980  Michelle    2432  37.271875 -119.270415  California
...    ...  ..   ...       ...     ...        ...         ...         ...
7099    WI   M  1983   Michael    1337  44.786297  -89.826705   Wisconsin
7100    WI   M  1984   Michael    1383  44.786297  -89.826705   Wisconsin
7101    WI   M  1984   Matthew    1252  44.786297  -89.826705   Wisconsin
7102    WI   M  1985   Michael    1265  44.786297  -89.826705   Wisconsin
7103    WI   M  1986   Michael    1207  44.786297  -89.826705   Wisconsin

[7104 rows x 8 columns]

In [24]:
df.reset_index(drop=True, inplace=True)

In [25]:
df

     State Sex  Year      Name  Number   Latitude   Longitude        City
0       CA   F  1980  Jennifer    5611  37.271875 -119.270415  California
1       CA   F  1980   Melissa    2984  37.271875 -119.270415  California
2       CA   F  1980   Jessica    2928  37.271875 -119.270415  California
3       CA   F  1980     Sarah    2578  37.271875 -119.270415  California
4       CA   F  1980  Michelle    2432  37.271875 -119.270415  California
...    ...  ..   ...       ...     ...        ...         ...         ...
7099    WI   M  1983   Michael    1337  44.786297  -89.826705   Wisconsin
7100    WI   M  1984   Michael    1383  44.786297  -89.826705   Wisconsin
7101    WI   M  1984   Matthew    1252  44.786297  -89.826705   Wisconsin
7102    WI   M  1985   Michael    1265  44.786297  -89.826705   Wisconsin
7103    WI   M  1986   Michael    1207  44.786297  -89.826705   Wisconsin

[7104 rows x 8 columns]

In [17]:
df.to_csv('Resources/Names.csv')

In [ ]:
##############Load###############

In [19]:
# Create database connection
connection_string = f'postgres:Koudede$89@localhost:5432/babynames_db'
engine = create_engine(f'postgresql+psycopg2://{connection_string}')

In [34]:
engine.table_names()

['baby_names']

In [21]:
df.to_sql(name='baby_names', con=engine, if_exists='append', index=False)

In [22]:
pd.read_sql_query('select* from baby_names limit(10)', con=engine).head()

  State Sex  Year      Name  Number   Latitude   Longitude        City
0    CA   F  1980  Jennifer    5611  37.271875 -119.270415  California
1    CA   F  1980   Melissa    2984  37.271875 -119.270415  California
2    CA   F  1980   Jessica    2928  37.271875 -119.270415  California
3    CA   F  1980     Sarah    2578  37.271875 -119.270415  California
4    CA   F  1980  Michelle    2432  37.271875 -119.270415  California

In [ ]:
#####from url############

In [2]:
engine= create_engine("postgres://uojmftnmharlnr:2afb0b29037d9b4cbf71fe7772cb4a0f499dad2c2133f74579a1f5d7cd3726da@ec2-54-160-202-3.compute-1.amazonaws.com:5432/d1rehkgcfdf1oa")
Base= automap_base()
Base.prepare(engine, reflect=True)
Base.classes.keys()

['baby_names']

In [5]:
baby_names = Base.classes.baby_names
session = Session(engine)

In [6]:

sel = [baby_names.Name, baby_names.State,baby_names.Sex, baby_names.Number,baby_names.Year, baby_names.Latitude,baby_names.Longitude,baby_names.City]
results= session.query(*sel).filter(baby_names.Year >=1980 ).filter(baby_names.Year <=2018)
data_map=[]
for r in results:
    dict={"name":r.Name,"year":r.Year, "sex":r.Sex,"number":r.Number, "long":r.Longitude, "lat":r.Latitude, "state":r.City}
    data_map.append(dict)
r=pd.DataFrame(data_map)
r

          name  year sex  number        long        lat       state
0     Jennifer  1980   F    5611 -119.270415  37.271875  California
1      Melissa  1980   F    2984 -119.270415  37.271875  California
2      Jessica  1980   F    2928 -119.270415  37.271875  California
3        Sarah  1980   F    2578 -119.270415  37.271875  California
4     Michelle  1980   F    2432 -119.270415  37.271875  California
...        ...   ...  ..     ...         ...        ...         ...
7099   Michael  1983   M    1337  -89.826705  44.786297   Wisconsin
7100   Michael  1984   M    1383  -89.826705  44.786297   Wisconsin
7101   Matthew  1984   M    1252  -89.826705  44.786297   Wisconsin
7102   Michael  1985   M    1265  -89.826705  44.786297   Wisconsin
7103   Michael  1986   M    1207  -89.826705  44.786297   Wisconsin

[7104 rows x 7 columns]

In [7]:
df= r.loc[r["sex"]=="F"]
df= df.rename(columns={'number':'number_f'})
dm= r.loc[r["sex"]=="M"]
dm= dm.rename(columns={'number':'number_m'})
Male_Names_number_Per_Year=dm[["name","number_m","year"]]
Female_Names_number_Per_Year=df[["name","number_f","year"]]

In [8]:
Female_Names_number_Per_Year["countnames"]=Female_Names_number_Per_Year['name'].count()

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [9]:
Male_Names_number_Per_Year["countnames"]=Male_Names_number_Per_Year['name'].count()

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [10]:
Gender_table=pd.merge(Male_Names_number_Per_Year,Female_Names_number_Per_Year , on="year")

Gender_table

,name_x,number_m,year,countnames_x,name_y,number_f,countnames_y
0,Michael,6906,1980,4936,Jennifer,5611,2168
1,Michael,6906,1980,4936,Melissa,2984,2168
2,Michael,6906,1980,4936,Jessica,2928,2168
3,Michael,6906,1980,4936,Sarah,2578,2168
4,Michael,6906,1980,4936,Michelle,2432,2168
...,...,...,...,...,...,...,...
326323,David,1207,2018,4936,Mia,1649,2168
326324,David,1207,2018,4936,Sophia,1618,2168
326325,David,1207,2018,4936,Camila,1532,2168
326326,David,1207,2018,4936,Ava,1363,2168
326327,David,1207,2018,4936,Sofia,1238,2168